[
  {
    "id": "dgda-guideline-1",
    "title": "DGDA Drug Scheduling Overview",
    "category": "Regulation",
    "content": "The Directorate General of Drug Administration (DGDA) classifies drugs into different schedules to regulate their sale, distribution, and use. Schedule H includes prescription-only medicines such as antibiotics, hormones, and certain pain medications. Schedule X covers controlled substances with high abuse potential including narcotics and psychotropic drugs. Schedule G includes prescription medicines requiring pharmacist supervision. OTC (Over-The-Counter) drugs can be sold without prescription for common ailments."
  },
  {
    "id": "dgda-guideline-2",
    "title": "Prescription Requirements",
    "category": "Regulation",
    "content": "A valid prescription in Bangladesh must include patient's full name and age, prescriber's name with BMDC registration number, hospital or clinic name and address, date of prescription, medicine name with dosage form and strength, quantity to be dispensed, dosing instructions, duration of treatment, and prescriber's signature and stamp. Prescriptions are generally valid for 6 months unless specified otherwise. For Schedule X drugs, validity may be shorter and stricter documentation is required."
  },
  {
    "id": "dgda-guideline-3",
    "title": "Online Pharmacy Regulations",
    "category": "Online Services",
    "content": "Online pharmacies in Bangladesh must obtain DGDA license to operate legally. They must maintain proper storage facilities with temperature control, employ qualified pharmacists, verify prescriptions for scheduled drugs before dispensing, maintain proper records of all transactions, ensure secure delivery with proper packaging, and provide customer support for medicine counseling. All online sales must comply with DGDA pricing and distribution guidelines."
  },
  {
    "id": "dgda-guideline-4",
    "title": "Antibiotic Stewardship",
    "category": "Public Health",
    "content": "DGDA enforces strict antibiotic regulations to combat antibiotic resistance. All antibiotics are prescription-only medicines (Schedule H). Pharmacies must verify prescriptions before dispensing. Patients must complete the full prescribed course even if symptoms improve. Leftover antibiotics should not be saved for future use or shared with others. Healthcare providers must prescribe antibiotics judiciously based on proper diagnosis."
  },
  {
    "id": "dgda-guideline-5",
    "title": "Medicine Storage and Handling",
    "category": "Safety",
    "content": "Medicines must be stored according to manufacturer's instructions. Most should be kept in cool, dry places (15-25°C) away from direct sunlight and moisture. Refrigerated medicines must be stored at 2-8°C. Frozen products require -20°C storage. Medicines should be kept in original containers with labels intact. Keep all medicines out of reach of children. Check expiry dates regularly and dispose of expired medicines properly through pharmacy take-back programs."
  },
  {
    "id": "dgda-guideline-6",
    "title": "Adverse Drug Reaction Reporting",
    "category": "Pharmacovigilance",
    "content": "Healthcare professionals and patients can report adverse drug reactions (ADRs) to DGDA's pharmacovigilance program. Serious ADRs include those causing death, hospitalization, disability, or birth defects. Report unexpected reactions, reactions to new medicines, or suspected quality issues. Reports can be submitted through DGDA website, mobile app, or directly to healthcare facilities. Reporting helps improve medicine safety for all patients."
  },
  {
    "id": "dgda-guideline-7",
    "title": "Generic Medicine Policy",
    "category": "Affordability",
    "content": "DGDA promotes use of quality generic medicines to improve affordability and access. Generic medicines must meet the same quality, safety, and efficacy standards as brand-name drugs through bioequivalence studies. Pharmacists may substitute brand-name drugs with approved generics unless prescriber specifies otherwise. All generic medicines must display DGDA registration number and meet Good Manufacturing Practice (GMP) standards."
  },
  {
    "id": "dgda-guideline-8",
    "title": "Controlled Substance Regulations",
    "category": "Narcotics Control",
    "content": "Schedule X controlled substances require special prescription on designated forms. Prescriptions are valid for 7-30 days only depending on the substance. Pharmacies must maintain separate registers for controlled substances with detailed records. Refills are generally not permitted. Patients may need to show identification when collecting controlled medicines. Misuse or diversion is subject to criminal prosecution under Bangladesh Narcotics Control Act."
  },
  {
    "id": "dgda-guideline-9",
    "title": "Pediatric Medicine Safety",
    "category": "Special Populations",
    "content": "Medicines for children require special attention. Dosing must be calculated based on age and weight. Many adult formulations are not suitable for children. Liquid formulations often require measuring devices for accurate dosing. Never use household spoons. Some medicines are contraindicated in specific age groups. Aspirin should not be given to children under 12 due to Reye's syndrome risk. Always consult pediatrician and follow dosing instructions carefully."
  },
  {
    "id": "dgda-guideline-10",
    "title": "Medicine Use in Pregnancy",
    "category": "Special Populations",
    "content": "Medicine use during pregnancy requires careful assessment of benefits versus risks. FDA pregnancy categories (A, B, C, D, X) or WHO classifications help guide decisions. Category A is safest; Category X is contraindicated. Many common medicines are unsafe in pregnancy. Inform all healthcare providers about pregnancy status. Do not stop prescribed medicines without consulting doctor. Some conditions like diabetes and hypertension require continued treatment during pregnancy with appropriate medicine adjustments."
  },
  {
    "id": "dgda-guideline-11",
    "title": "Medicine Use During Breastfeeding",
    "category": "Special Populations",
    "content": "Most medicines pass into breast milk in varying amounts. Some are safe, others require caution or are contraindicated. Factors include medicine properties, maternal dose, infant age and health status. When medicine is necessary, choose safest option, use lowest effective dose, and time doses to minimize infant exposure. Monitor infant for adverse effects. Do not stop breastfeeding without medical advice as benefits usually outweigh risks."
  },
  {
    "id": "dgda-guideline-12",
    "title": "Geriatric Medicine Considerations",
    "category": "Special Populations",
    "content": "Elderly patients often require dose adjustments due to age-related changes in drug metabolism and kidney/liver function. They are more susceptible to adverse effects and drug interactions due to polypharmacy. Regular medication review is essential. Beers Criteria identifies potentially inappropriate medicines in elderly. Ensure proper labeling and packaging for patients with vision or dexterity issues. Monitor for confusion, falls, and other age-related complications."
  },
  {
    "id": "dgda-guideline-13",
    "title": "Drug Interaction Management",
    "category": "Safety",
    "content": "Drug interactions can be drug-drug, drug-food, or drug-disease. Pharmacodynamic interactions affect drug action; pharmacokinetic interactions affect absorption, distribution, metabolism, or excretion. Common interactions include NSAIDs with blood thinners, antibiotics with oral contraceptives, and grapefruit juice with certain medicines. Maintain updated medication list including OTC drugs, supplements, and herbals. Consult pharmacist when starting new medicines."
  },
  {
    "id": "dgda-guideline-14",
    "title": "Medicine Pricing and Availability",
    "category": "Economic",
    "content": "DGDA regulates medicine pricing to ensure affordability and access. Essential medicines have price controls. Generic medicines offer cost savings while maintaining quality. Maximum retail price (MRP) must be printed on packaging. Pharmacies cannot charge above MRP. If essential medicines are unavailable, patients can report to DGDA hotline. DGDA monitors drug availability and takes action against hoarding or artificial shortages."
  },
  {
    "id": "dgda-guideline-15",
    "title": "Counterfeit and Substandard Medicines",
    "category": "Safety",
    "content": "Counterfeit medicines are deliberately mislabeled products that may contain wrong ingredients, no active ingredients, or wrong amounts. Substandard medicines result from manufacturing defects. Both pose serious health risks. Purchase medicines only from licensed pharmacies. Check DGDA registration number, packaging quality, spelling errors, and price (too cheap is suspicious). Report suspected cases to DGDA immediately. Use DGDA mobile app to verify medicine authenticity."
  }
]
